hysonglet/platformio_synwit/misc/svd/SWM190.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA</name>
      <description>Registers group</description>
      <groupName>DMA</groupName>
      <baseAddress>0x40000800</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x000140</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>EN</name>
          <description>EN register</description>
          <addressOffset>0x000000</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>IE</name>
          <description>IE register</description>
          <addressOffset>0x000004</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH0</name>
              <description>CH0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1</name>
              <description>CH1 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2</name>
              <description>CH2 field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3</name>
              <description>CH3 field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IM</name>
          <description>IM register</description>
          <addressOffset>0x000008</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH0</name>
              <description>CH0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1</name>
              <description>CH1 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2</name>
              <description>CH2 field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3</name>
              <description>CH3 field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF</name>
          <description>IF register</description>
          <addressOffset>0x00000C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH0</name>
              <description>CH0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1</name>
              <description>CH1 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2</name>
              <description>CH2 field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3</name>
              <description>CH3 field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSTSGIE</name>
          <description>DSTSGIE register</description>
          <addressOffset>0x000010</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>DSTSGIM</name>
          <description>DSTSGIM register</description>
          <addressOffset>0x000014</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>DSTSGIF</name>
          <description>DSTSGIF register</description>
          <addressOffset>0x000018</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>SRCSGIE</name>
          <description>SRCSGIE register</description>
          <addressOffset>0x00001C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>SRCSGIM</name>
          <description>SRCSGIM register</description>
          <addressOffset>0x000020</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>SRCSGIF</name>
          <description>SRCSGIF register</description>
          <addressOffset>0x000024</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PRI</name>
          <description>PRI register</description>
          <addressOffset>0x00003C</addressOffset>
          <access>read-write</access>
        </register>
        <cluster>
          <name>CH0</name>
          <description>register cluster</description>
          <addressOffset>0x000040</addressOffset>
          <register>
            <name>CR</name>
            <description>CR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>LEN</name>
                <description>LEN field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RXEN</name>
                <description>RXEN field</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TXEN</name>
                <description>TXEN field</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AUTORE</name>
                <description>AUTORE field</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AM</name>
            <description>AM register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>DSTAM</name>
                <description>DSTAM field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DSTBIT</name>
                <description>DSTBIT field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DSTBURST</name>
                <description>DSTBURST field</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SRCAM</name>
                <description>SRCAM field</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SRCBIT</name>
                <description>SRCBIT field</description>
                <bitOffset>10</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SRCBURST</name>
                <description>SRCBURST field</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DST</name>
            <description>DST register</description>
            <addressOffset>0x000008</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>DSTSGADDR1</name>
            <description>DSTSGADDR1 register</description>
            <addressOffset>0x00000C</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>DSTSGADDR2</name>
            <description>DSTSGADDR2 register</description>
            <addressOffset>0x000010</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>DSTSGADDR3</name>
            <description>DSTSGADDR3 register</description>
            <addressOffset>0x000014</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>MUX</name>
            <description>MUX register</description>
            <addressOffset>0x000018</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>M0TRGSRC</name>
                <description>M0TRGSRC field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>M0TRGEN</name>
                <description>M0TRGEN field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>M1TRGSRC</name>
                <description>M1TRGSRC field</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>M1TRGEN</name>
                <description>M1TRGEN field</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TRGSRC</name>
                <description>TRGSRC field</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TRGEN</name>
                <description>TRGEN field</description>
                <bitOffset>19</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SRC</name>
            <description>SRC register</description>
            <addressOffset>0x00001C</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>SRCSGADDR1</name>
            <description>SRCSGADDR1 register</description>
            <addressOffset>0x000020</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>SRCSGADDR2</name>
            <description>SRCSGADDR2 register</description>
            <addressOffset>0x000024</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>SRCSGADDR3</name>
            <description>SRCSGADDR3 register</description>
            <addressOffset>0x000028</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>SR</name>
            <description>SR register</description>
            <addressOffset>0x00002C</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>DSTLEN</name>
                <description>DSTLEN field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>13</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DSTERR</name>
                <description>DSTERR field</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>SRCLEN</name>
                <description>SRCLEN field</description>
                <bitOffset>16</bitOffset>
                <bitWidth>13</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>SRCERR</name>
                <description>SRCERR field</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>CH1</name>
          <description>register cluster</description>
          <addressOffset>0x000080</addressOffset>
          <register>
            <name>CR</name>
            <description>CR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>LEN</name>
                <description>LEN field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RXEN</name>
                <description>RXEN field</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TXEN</name>
                <description>TXEN field</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AUTORE</name>
                <description>AUTORE field</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AM</name>
            <description>AM register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>DSTAM</name>
                <description>DSTAM field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DSTBIT</name>
                <description>DSTBIT field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DSTBURST</name>
                <description>DSTBURST field</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SRCAM</name>
                <description>SRCAM field</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SRCBIT</name>
                <description>SRCBIT field</description>
                <bitOffset>10</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SRCBURST</name>
                <description>SRCBURST field</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DST</name>
            <description>DST register</description>
            <addressOffset>0x000008</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>DSTSGADDR1</name>
            <description>DSTSGADDR1 register</description>
            <addressOffset>0x00000C</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>DSTSGADDR2</name>
            <description>DSTSGADDR2 register</description>
            <addressOffset>0x000010</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>DSTSGADDR3</name>
            <description>DSTSGADDR3 register</description>
            <addressOffset>0x000014</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>MUX</name>
            <description>MUX register</description>
            <addressOffset>0x000018</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>M0TRGSRC</name>
                <description>M0TRGSRC field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>M0TRGEN</name>
                <description>M0TRGEN field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>M1TRGSRC</name>
                <description>M1TRGSRC field</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>M1TRGEN</name>
                <description>M1TRGEN field</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TRGSRC</name>
                <description>TRGSRC field</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TRGEN</name>
                <description>TRGEN field</description>
                <bitOffset>19</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SRC</name>
            <description>SRC register</description>
            <addressOffset>0x00001C</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>SRCSGADDR1</name>
            <description>SRCSGADDR1 register</description>
            <addressOffset>0x000020</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>SRCSGADDR2</name>
            <description>SRCSGADDR2 register</description>
            <addressOffset>0x000024</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>SRCSGADDR3</name>
            <description>SRCSGADDR3 register</description>
            <addressOffset>0x000028</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>SR</name>
            <description>SR register</description>
            <addressOffset>0x00002C</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>DSTLEN</name>
                <description>DSTLEN field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>13</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DSTERR</name>
                <description>DSTERR field</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>SRCLEN</name>
                <description>SRCLEN field</description>
                <bitOffset>16</bitOffset>
                <bitWidth>13</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>SRCERR</name>
                <description>SRCERR field</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
