hysonglet/platformio_synwit/misc/svd/SWM190.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CACHE</name>
      <description>Registers group</description>
      <groupName>CACHE</groupName>
      <baseAddress>0x40005800</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x000024</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <description>CR register</description>
          <addressOffset>0x000000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>RST</name>
              <description>RST field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALG</name>
              <description>ALG field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDLE</name>
              <description>IDLE field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PREFCR</name>
          <description>PREFCR register</description>
          <addressOffset>0x000004</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>UNLOCK</name>
              <description>UNLOCK field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PREFET</name>
              <description>PREFET field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDR</name>
              <description>ADDR field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDY</name>
              <description>RDY field</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IE</name>
          <description>IE register</description>
          <addressOffset>0x000008</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>EN field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PREFET</name>
              <description>PREFET field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNLOCK</name>
              <description>UNLOCK field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCKLMT</name>
              <description>LOCKLMT field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCKLMT</name>
          <description>LOCKLMT register</description>
          <addressOffset>0x00000C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>LOCKCNT</name>
          <description>LOCKCNT register</description>
          <addressOffset>0x000010</addressOffset>
          <access>read-only</access>
        </register>
        <register>
          <name>CURLINE</name>
          <description>CURLINE register</description>
          <addressOffset>0x000014</addressOffset>
          <access>read-only</access>
        </register>
        <register>
          <name>ACCESSCNT</name>
          <description>ACCESSCNT register</description>
          <addressOffset>0x000018</addressOffset>
          <access>read-only</access>
        </register>
        <register>
          <name>HITCNT</name>
          <description>HITCNT register</description>
          <addressOffset>0x00001C</addressOffset>
          <access>read-only</access>
        </register>
        <register>
          <name>IF</name>
          <description>IF register</description>
          <addressOffset>0x000020</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>PREOK</name>
              <description>PREOK field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PREFAIL</name>
              <description>PREFAIL field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNLOK</name>
              <description>UNLOK field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCKLMT</name>
              <description>LOCKLMT field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
